#+TITLE: Adam's Time Log
#+AUTHOR: Adam Keenan
#+DATE: Spring 2014
#+TODO: TODO IN-PROGRESS SUBMITTED DONE
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

* Week1

** DONE Learn Org-Mode
CLOSED: [2014-02-20 Thu 15:28]
- CLOSING NOTE [2014-02-20 Thu 15:28] \\
  Sorta got it down
   CLOCK: [2014-02-16 Sun 15:30]--[2014-02-16 Sun 17:30] =>  2:00

** DONE Nurk-Talk
CLOSED: [2014-02-20 Thu 15:27]
- CLOSING NOTE [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 14:03]--[2014-02-18 Tue 14:23] =>  0:20
  
** DONE Setup Virtualenv
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:23]--[2014-02-18 Tue 15:29] =>  0:06

** DONE Install django and debug-toolbar
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:30]--[2014-02-18 Tue 15:32] =>  0:02

** DONE Set up work environment
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:30]--[2014-02-18 Tue 15:49] =>  0:19
   
** DONE Add django settings to postactivate
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:54]--[2014-02-18 Tue 16:03] =>  0:09

** IN-PROGRESS Read the Time-logging doc
:LOGBOOK:
CLOCK: [2014-02-20 Thu 14:00]--[2014-02-20 Thu 16:00] =>  2:00
:END:

* Week2
** DONE Fix emacs
CLOSED: [2014-02-21 Fri 16:39]
:LOGBOOK:
CLOCK: [2014-02-20 Thu 15:35]--[2014-02-20 Thu 15:41] =>  0:06
- Emacs was being silly with org
:END:
** DONE Talk about layout and UX Diagrams
CLOSED: [2014-02-21 Fri 16:40]
:LOGBOOK:
- CLOSING NOTE [2014-02-21 Fri 16:40] \\
  Me and dustin work on templates
CLOCK: [2014-02-20 Thu 14:00]--[2014-02-20 Thu 15:50] =>  1:50
:END:
** DONE Setup network share to mount
CLOSED: [2014-02-21 Fri 16:40]
:LOGBOOK:
CLOCK: [2014-02-21 Fri 16:10]--[2014-02-21 Fri 16:15] =>  0:05
- Helped Dustin with it
CLOCK: [2014-02-21 Fri 16:03]--[2014-02-21 Fri 16:10] =>  0:07
- Added to fstab
:END:
** SUBMITTED Work on the base.html
:LOGBOOK:
CLOCK: [2014-02-21 Fri 17:30]--[2014-02-21 Fri 22:07] =>  4:37
CLOCK: [2014-02-21 Fri 16:55]--[2014-02-21 Fri 17:27] =>  0:32
CLOCK: [2014-02-21 Fri 16:40]--[2014-02-21 Fri 16:43] =>  0:03
:END:
** DONE Make second base.html for choices
CLOSED: [2014-02-23 Sun 23:30]
:LOGBOOK:
CLOCK: [2014-02-23 Sun 23:04]--[2014-02-23 Sun 23:24] =>  0:20
- Added non-static version of navbar
:END:
* Week3
** DONE Tues Class
CLOSED: [2014-03-04 Tue 14:34]
:LOGBOOK:
CLOCK: [2014-02-25 Tue 14:00]--[2014-02-25 Tue 16:00] =>  2:00
:END:
** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-02-27 Tue 14:00]--[2014-02-27 Tue 16:00] =>  2:00
:END:

* Week4

** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-03-04 Tue 12:00]--[2014-03-04 Tue 16:00] =>  2:00
- Removed detail and list templates because we don't think that they will be used.
  Installed and set up nginx to load default site. Added config for django app but haven't tested or set up really.
:END:

** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-03-06 Thu 14:00]--[2014-03-06 Thu 16:00] =>  2:00
- Made comparison detail template
- Switched to Linux Mint
:END:

* Week5

** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-03-11 Thu 14:00]--[2014-03-11 Thu 16:00] =>  2:00
:END:

** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-03-13 Thu 16:00]--[2014-03-13 Thu 18:44] =>  2:44
- Made blink_to
CLOCK: [2014-03-13 Thu 14:00]--[2014-03-13 Thu 16:00] =>  2:00
- Got south working
  Added actual projects to navbar
:END:

** TODO XML Importer
:LOGBOOK:
CLOCK: [2014-03-15 Sat 02:20]--[2014-03-15 Sat 06:20] =>  4:00
- This will now import xml and output it as json.
  I wrote it as a manage.py command.
  I also added a utility function in backend.utils to assist.
:END:

* Week6
** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-03-18 Tue 14:00]--[2014-03-18 Tue 16:00] =>  2:00
- Improved XML Importer
:END:
** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-03-20 Thu 14:04]--[2014-03-20 Thu 18:48] =>  4:44
- Fixed database. Understood that exports are wrong
CLOCK: [2014-03-21 Fri 12:00]--[2014-03-21 Fri 01:49] =>  1:49
- Fixed database. Understood that exports are wrong
:END:
** TODO Work on xml_importer
:LOGBOOK:
CLOCK: [2014-03-21 Fri 22:00]--[2014-03-21 Fri 00:00] =>  2:00
- Fixed some things
:END:

* Week8
** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-04-01 Tue 14:00]--[2014-04-01 Tue 16:01] =>  2:01
- Worked with formatting. Fixing indentation errors
:END:
** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-04-03 Thu 14:00]--[2014-04-03 Thu 18:03] =>  4:03
- Added metadata to variety and add that yo the importer
:END:

* Week9
** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-04-08 Tue 17:17]--[2014-04-08 Tue 17:32] =>  0:15
- Started looking at IPA keyboard stuff
CLOCK: [2014-04-08 Tue 16:05]--[2014-04-08 Tue 17:17] =>  1:12
- Fixed the footer
CLOCK: [2014-04-08 Tue 14:00]--[2014-04-08 Tue 16:05] =>  2:05
- Meeting and code review
:END:
** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-04-10 Thu 14:12]--[2014-04-10 Thu 16:58] =>  2:46
- Worked on IPA keyboard
:END:


* Clocktable
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2014-04-10 Thu 17:17]
| Headline                                     |      Time |      |
|----------------------------------------------+-----------+------|
| *Total time*                                 | *2d 4:26* |      |
|----------------------------------------------+-----------+------|
| Week1                                        |      4:56 |      |
| \__ DONE Learn Org-Mode                      |           | 2:00 |
| \__ DONE Nurk-Talk                           |           | 0:20 |
| \__ DONE Setup Virtualenv                    |           | 0:06 |
| \__ DONE Install django and debug-toolbar    |           | 0:02 |
| \__ DONE Set up work environment             |           | 0:19 |
| \__ DONE Add django settings to postactivate |           | 0:09 |
| \__ IN-PROGRESS Read the Time-logging doc    |           | 2:00 |
| Week2                                        |      7:40 |      |
| \__ DONE Fix emacs                           |           | 0:06 |
| \__ DONE Talk about layout and UX Diagrams   |           | 1:50 |
| \__ DONE Setup network share to mount        |           | 0:12 |
| \__ SUBMITTED Work on the base.html          |           | 5:12 |
| \__ DONE Make second base.html for choices   |           | 0:20 |
| Week3                                        |      4:00 |      |
| \__ DONE Tues Class                          |           | 2:00 |
| \__ TODO Thurs Class                         |           | 2:00 |
| Week4                                        |      6:00 |      |
| \__ TODO Tues Class                          |           | 4:00 |
| \__ TODO Thurs Class                         |           | 2:00 |
| Week5                                        |     10:44 |      |
| \__ TODO Tues Class                          |           | 2:00 |
| \__ TODO Thurs Class                         |           | 4:44 |
| \__ TODO XML Importer                        |           | 4:00 |
| Week6                                        |      6:44 |      |
| \__ TODO Tues Class                          |           | 2:00 |
| \__ TODO Thurs Class                         |           | 4:44 |
| Week8                                        |      6:04 |      |
| \__ TODO Tues Class                          |           | 2:01 |
| \__ TODO Thurs Class                         |           | 4:03 |
| Week9                                        |      6:18 |      |
| \__ TODO Tues Class                          |           | 3:32 |
| \__ TODO Thurs Class                         |           | 2:46 |
#+END:
